
 <!DOCTYPE HTML>
<html >
<head>
  <meta charset="UTF-8">
  
    <title>推荐引擎之协同过滤算法小综述 | Timmy live</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="Lee">
    

    
    <meta name="description" content="&amp;#x8F6C;&amp;#x81EA; DM&amp;#x5F20;&amp;#x670B;&amp;#x98DE; CNBlogs&amp;#x6570;&amp;#x5B66;&amp;#x671F;&amp;#x671B;&amp;#x7684;&amp;#x7406;&amp;#x89E3;&amp;#x5FAE;&amp;#x7B11;&amp;#x65E9;&amp;#x4E9B;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x6CD5;&amp;#x56FD;&amp;#x6709;&amp;#x4E24;&amp;#x4E">
<meta property="og:type" content="article">
<meta property="og:title" content="推荐引擎之协同过滤算法小综述">
<meta property="og:url" content="http://yoursite.com/2016/07/21/Correlation/index.html">
<meta property="og:site_name" content="Timmy live">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA; DM&amp;#x5F20;&amp;#x670B;&amp;#x98DE; CNBlogs&amp;#x6570;&amp;#x5B66;&amp;#x671F;&amp;#x671B;&amp;#x7684;&amp;#x7406;&amp;#x89E3;&amp;#x5FAE;&amp;#x7B11;&amp;#x65E9;&amp;#x4E9B;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x6CD5;&amp;#x56FD;&amp;#x6709;&amp;#x4E24;&amp;#x4E">
<meta property="og:image" content="http://yoursite.com/2016/07/21/Correlation/school.png">
<meta property="og:image" content="http://yoursite.com/2016/07/21/Correlation/deploy.png">
<meta property="og:image" content="http://yoursite.com/2016/07/21/Correlation/lisan.png">
<meta property="og:image" content="http://yoursite.com/2016/07/21/Correlation/user2item.png">
<meta property="og:image" content="http://yoursite.com/2016/07/21/Correlation/xiangsidu.png">
<meta property="og:image" content="http://yoursite.com/2016/07/21/Correlation/tuicepingfen.png">
<meta property="og:image" content="http://yoursite.com/2016/07/21/Correlation/itemsimailar.png">
<meta property="og:image" content="http://yoursite.com/2016/07/21/Correlation/restrateion.png">
<meta property="og:image" content="http://yoursite.com/2016/07/21/Correlation/itemsimailar.png">
<meta property="og:updated_time" content="2016-07-21T15:52:49.279Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="推荐引擎之协同过滤算法小综述">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA; DM&amp;#x5F20;&amp;#x670B;&amp;#x98DE; CNBlogs&amp;#x6570;&amp;#x5B66;&amp;#x671F;&amp;#x671B;&amp;#x7684;&amp;#x7406;&amp;#x89E3;&amp;#x5FAE;&amp;#x7B11;&amp;#x65E9;&amp;#x4E9B;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x6CD5;&amp;#x56FD;&amp;#x6709;&amp;#x4E24;&amp;#x4E">
<meta name="twitter:image" content="http://yoursite.com/2016/07/21/Correlation/school.png">

    
    <link rel="alternative" href="/atom.xml" title="Timmy live" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.jpg" alt="Timmy live" title="Timmy live"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="Timmy live">Timmy live</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="Menu">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页Home</a></li>
					
						<li><a href="/archives">归档Archives</a></li>
					
						<li><a href="/about">关于About</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="Search" />
						<input type="hidden" name="q" value="site:yoursite.com">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/07/21/Correlation/" title="推荐引擎之协同过滤算法小综述" itemprop="url">推荐引擎之协同过滤算法小综述</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Lee" target="_blank" itemprop="author">Lee</a>
		
  <p class="article-time">
    <time datetime="2016-07-21T15:35:48.000Z" itemprop="datePublished"> Published 2016-07-21</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">Contents</strong>
		
			<ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#转自-DM张朋飞-CNBlogs"><span class="toc-number">1.</span> <span class="toc-text">转自 DM张朋飞 CNBlogs</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#数学期望的理解"><span class="toc-number">1.1.</span> <span class="toc-text">数学期望的理解</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#皮尔逊相关系数的理解"><span class="toc-number">1.2.</span> <span class="toc-text">皮尔逊相关系数的理解</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#基于用户的协同过滤算法"><span class="toc-number">1.3.</span> <span class="toc-text">基于用户的协同过滤算法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#基于物品的协同过滤算法"><span class="toc-number">1.4.</span> <span class="toc-text">基于物品的协同过滤算法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#实际应用"><span class="toc-number">1.5.</span> <span class="toc-text">实际应用</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#参考文献"><span class="toc-number">1.6.</span> <span class="toc-text">参考文献</span></a></li></ol></li></ol>
		
		</div>
		
		<h2 id="&#x8F6C;&#x81EA;-DM&#x5F20;&#x670B;&#x98DE;-CNBlogs"><a href="#&#x8F6C;&#x81EA;-DM&#x5F20;&#x670B;&#x98DE;-CNBlogs" class="headerlink" title="&#x8F6C;&#x81EA; DM&#x5F20;&#x670B;&#x98DE; CNBlogs"></a>&#x8F6C;&#x81EA;<a href="http://www.cnblogs.com/hxsyl/p/4211816.html" target="_blank" rel="external"> DM&#x5F20;&#x670B;&#x98DE; CNBlogs</a></h2><h3 id="&#x6570;&#x5B66;&#x671F;&#x671B;&#x7684;&#x7406;&#x89E3;"><a href="#&#x6570;&#x5B66;&#x671F;&#x671B;&#x7684;&#x7406;&#x89E3;" class="headerlink" title="&#x6570;&#x5B66;&#x671F;&#x671B;&#x7684;&#x7406;&#x89E3;"></a>&#x6570;&#x5B66;&#x671F;&#x671B;&#x7684;&#x7406;&#x89E3;</h3><p>&#x5FAE;&#x7B11;&#x65E9;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x6CD5;&#x56FD;&#x6709;&#x4E24;&#x4E2A;&#x5927;&#x6570;&#x5B66;&#x5BB6;&#xFF0C;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x5E03;&#x83B1;&#x58EB;&#xB7;&#x5E15;&#x65AF;&#x5361;&#xFF0C;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x8D39;&#x9A6C;&#x3002;&#x5E15;&#x65AF;&#x5361;&#x8BA4;&#x8BC6;&#x4E24;&#x4E2A;&#x8D4C;&#x5F92;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x8D4C;&#x5F92;&#x5411;&#x4ED6;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x4EEC;&#x8BF4;&#xFF0C;&#x4ED6;&#x4FE9;&#x4E0B;&#x8D4C;&#x91D1;&#x4E4B;&#x540E;&#xFF0C;&#x7EA6;&#x5B9A;&#x8C01;&#x5148;&#x8D62;&#x6EE1;5&#x5C40;&#xFF0C;&#x8C01;&#x5C31;&#x83B7;&#x5F97;&#x5168;&#x90E8;&#x8D4C;&#x91D1;&#x3002;&#x8D4C;&#x4E86;&#x534A;&#x5929;&#xFF0C;A&#x8D62;&#x4E86;4&#x5C40;&#xFF0C;B&#x8D62;&#x4E86;3&#x5C40;&#xFF0C;&#x65F6;&#x95F4;&#x5F88;&#x665A;&#x4E86;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x4E0D;&#x60F3;&#x518D;&#x8D4C;&#x4E0B;&#x53BB;&#x4E86;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x8FD9;&#x4E2A;&#x94B1;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5206;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x628A;&#x94B1;&#x5206;&#x6210;7&#x4EFD;&#xFF0C;&#x8D62;&#x4E86;4&#x5C40;&#x7684;&#x5C31;&#x62FF;4&#x4EFD;&#xFF0C;&#x8D62;&#x4E86;3&#x5C40;&#x7684;&#x5C31;&#x62FF;3&#x4EFD;&#x5462;&#xFF1F;&#x6216;&#x8005;&#xFF0C;&#x56E0;&#x4E3A;&#x6700;&#x65E9;&#x8BF4;&#x7684;&#x662F;&#x6EE1;5&#x5C40;&#xFF0C;&#x800C;&#x8C01;&#x4E5F;&#x6CA1;&#x8FBE;&#x5230;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x4E00;&#x4EBA;&#x5206;&#x4E00;&#x534A;&#x5462;&#xFF1F;&#x8FD9;&#x4E24;&#x79CD;&#x5206;&#x6CD5;&#x90FD;&#x4E0D;&#x5BF9;&#x3002;&#x6B63;&#x786E;&#x7684;&#x7B54;&#x6848;&#x662F;&#xFF1A;&#x8D62;&#x4E86;4&#x5C40;&#x7684;&#x62FF;&#x8FD9;&#x4E2A;&#x94B1;&#x7684;3/4&#xFF0C;&#x8D62;&#x4E86;3&#x5C40;&#x7684;&#x62FF;&#x8FD9;&#x4E2A;&#x94B1;&#x7684;1/4&#x3002;<br>&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5047;&#x5B9A;&#x4ED6;&#x4EEC;&#x4FE9;&#x518D;&#x8D4C;&#x4E00;&#x5C40;&#xFF0C;A&#x6709;1/2&#x7684;&#x53EF;&#x80FD;&#x8D62;&#x5F97;&#x4ED6;&#x7684;&#x7B2C;5&#x5C40;&#xFF0C;B&#x6709;1/2&#x7684;&#x53EF;&#x80FD;&#x8D62;&#x5F97;&#x4ED6;&#x7684;&#x7B2C;4&#x5C40;&#x3002;&#x82E5;&#x662F;A&#x8D62;&#x6EE1;&#x4E86;5&#x5C40;&#xFF0C;&#x94B1;&#x5E94;&#x8BE5;&#x5168;&#x5F52;&#x4ED6;&#xFF1B;&#x82E5;B&#x8D62;&#x5F97;&#x4ED6;&#x7684;&#x7B2C;4&#x5C40;&#xFF0C;&#x5219;&#x4E0B;&#x4E00;&#x5C40;&#x4E2D;A&#x3001;B&#x8D62;&#x5F97;&#x4ED6;&#x4EEC;&#x5404;&#x81EA;&#x7684;&#x7B2C;5&#x5C40;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x90FD;&#x662F;1/2&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x5FC5;&#x987B;&#x8D62;&#x6EE1;5&#x5C40;&#x7684;&#x8BDD;&#xFF0C;A&#x8D62;&#x5F97;&#x6240;&#x6709;&#x94B1;&#x7684;&#x53EF;&#x80FD;&#x4E3A;1/2+1/2&#xD7;1/2=3/4,&#x5F53;&#x7136;&#xFF0C;B&#x5C31;&#x5E94;&#x8BE5;&#x5F97;1/4&#x3002;<br>&#x6570;&#x5B66;&#x671F;&#x671B;&#x7531;&#x6B64;&#x800C;&#x6765;&#x3002;<br>&#x5FAE;&#x7B11;&#x4E3A;&#x4EC0;&#x4E48;&#x5199;&#x8FD9;&#x4E2A;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x6211;&#x53D1;&#x73B0;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x91CC;&#x5F88;&#x591A;&#x516C;&#x5F0F;&#x7684;&#x5206;&#x5B50;&#x662F;&#x6743;&#x503C;&#x548C;&#x503C;&#x6210;&#x7EE9;&#x7684;&#x8FDE;&#x52A0;&#x548C;&#xFF0C;&#x5206;&#x6BCD;&#x662F;&#x6743;&#x503C;&#x4E4B;&#x548C;(&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x52A0;&#x6743;&#x5E73;&#x5747;)&#xFF0C;&#x5982;&#x679C;&#x5206;&#x5F00;&#x770B;&#xFF0C;&#x4E0D;&#x5C31;&#x662F;&#x6982;&#x7387;(&#x770B;&#x4F5C;&#x662F;&#x6743;&#x503C;&#x7684;&#x5F52;&#x4E00;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6EE1;&#x8DB3;&#x4E86;&#x76F8;&#x52A0;&#x4E3A;1&#x7684;&#x6027;&#x8D28;&#xFF0C;&#x90A3;&#x4E48;&#x80AF;&#x5B9A;&#x662F;&#x6982;&#x7387;&#x4E86;)&#x4E58;&#x4EE5;&#x503C;&#x7684;&#x8FDE;&#x52A0;&#x548C;&#x4E48;&#x3002;<br>&#x671F;&#x671B;(Expected-Value)&#x5C31;&#x662F;&#x6982;&#x7387;&#x548C;&#x4EF7;&#x503C;&#x91CF;&#x4E58;&#x79EF;&#x7684;&#x7D2F;&#x52A0;&#x548C;&#x3002;<br>&#x5FAE;&#x7B11;&#x8BA4;&#x8BC6;&#x7684;&#x8BEF;&#x533A;&#x3002;</p>
<ol>
<li>&#x6570;&#x5B66;&#x671F;&#x671B;&#x662F;&#x5F53;&#x4E8B;&#x4EBA;&#x5FC3;&#x7406;&#x4E0A;&#x6700;&#x613F;&#x610F;&#x6216;&#x6700;&#x73B0;&#x5B9E;&#x7684;&#x83B7;&#x5229;&#x3002;&#x548C;&#x6C49;&#x8BED;&#x7406;&#x89E3;&#x6DF7;&#x6DC6;&#xFF0C;&#x5982;&#xFF1A;&#x67D0;A&#x7F5A;&#x7403;&#x547D;&#x4E2D;&#x7387;0.6&#xFF0C;&#x4E2D;&#x7684;1&#x5206;&#xFF0C;&#x4E0D;&#x4E2D;0&#x5206;&#xFF0C;&#x90A3;&#x4E48;&#x6295;&#x4E00;&#x6B21;&#xFF0C;&#x5F97;&#x5206;&#x7684;&#x671F;&#x671B;&#x662F;1&#x6216;0(&#x6211;&#x671F;&#x671B;&#x6295;&#x4E2D;&#xFF0C;&#x6211;&#x80AF;&#x5B9A;&#x6295;&#x4E0D;&#x4E2D;)&#x3002;&#x89E3;&#x6790;&#xFF1A;&#x6982;&#x7387;&#x503C;&#x4F1A;&#x5F71;&#x54CD;&#x671F;&#x671B;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6CA1;&#x8003;&#x8651;&#x6982;&#x7387;&#x3002;&#x6570;&#x5B66;&#x671F;&#x671B;&#x7B80;&#x79F0;&#x671F;&#x671B;&#xFF0C;&#x4EE5;&#x540E;&#x8FD8;&#x662F;&#x53EA;&#x53EB;&#x6570;&#x5B66;&#x671F;&#x671B;&#x5427;&#x3002;</li>
<li>&#x5B9E;&#x9645;&#x53D1;&#x751F;&#x6982;&#x7387;&#x6700;&#x5927;&#x7684;&#x83B7;&#x5229;&#x3002;&#x54B1;&#x4EEC;ABCD&#x4E00;&#x822C;&#x9009;&#x62E9;&#x5462;BC&#x4F5C;&#x4E3A;&#x6B63;&#x786E;&#x7B54;&#x6848;&#x3002;0.1A&#xFF0C;0.9B&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x5B9A;&#x9009;B&#x4E48;&#xFF1F;</li>
<li>&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x83B7;&#x5229;&#x7684;&#x5E73;&#x5747;&#x503C;&#x3002;<br>&#x7B14;&#x8005;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#x662F;&#x7B2C;&#x4E09;&#x4E2A;,&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x7406;&#x89E3;&#x5462;&#xFF1F;&#x5B9A;&#x4E49;&#x4E0A;&#x8BF4;&#x671F;&#x671B;&#x53CD;&#x6620;&#x4E86;&#x79BB;&#x6563;&#x578B;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x7684;&#x53D6;&#x503C;&#x7684;&#x5E73;&#x5747;&#x6C34;&#x5E73;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x5BF9;&#x7B2C;&#x4E09;&#x4E2A;&#x7684;&#x7406;&#x89E3;&#x6709;&#x8BEF;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x8BF4;&#x53EA;&#x662F;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x6CA1;&#x6709;&#x4E58;&#x4EE5;&#x6982;&#x7387;&#x3002;<br>&#x5FAE;&#x7B11;&#x4F8B;&#x9898;&#x89E3;&#x6790;<br>&#x67D0;&#x4E66;&#x5E97;&#x8BA1;&#x5212;&#x8BA2;&#x8D2D;&#x4E00;&#x672C;&#x65B0;&#x7248;&#x4E66;&#xFF0C;&#x6839;&#x636E;&#x4EE5;&#x5F80;&#x7ECF;&#x9A8C;&#x6765;&#x9884;&#x6D4B;&#xFF0C;&#x8FD9;&#x672C;&#x65B0;&#x4E66;&#x9500;&#x91CF;&#x4E3A;40&#x672C;&#xFF0C;100&#x672C;&#xFF0C;120&#x672C;&#x7684;&#x6982;&#x7387;&#x4E3A;0.2,0.7,0.1&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x8BA2;&#x8D2D;&#x4EF7;&#x4F4D;6&#x5143;&#xFF0C;&#x9500;&#x552E;&#x4EF7;&#x4F4D;8&#x5143;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x65F6;&#x517D;&#x4E0D;&#x51FA;&#xFF0C;&#x53EA;&#x80FD;&#x4EE5;&#x6BCF;&#x672C;5&#x5143;&#x7684;&#x4EF7;&#x683C;&#x4F5C;&#x4E3A;&#x5269;&#x4E66;&#x5904;&#x7406;&#x3002;&#x8BF7;&#x5E2E;&#x52A9;&#x5E97;&#x4E3B;&#x51B3;&#x7B56;&#x5E94;&#x8BA2;&#x8D2D;&#x591A;&#x5C11;&#x672C;&#x65B0;&#x4E66;&#x8F83;&#x4E3A;&#x5408;&#x7406;&#x3002;<br>&#x89E3;&#x7B54;&#xFF1A;&#x5982;&#x679C;&#x6211;&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x505A;&#x5F97;&#x51FA;&#x6765;&#xFF0C;&#x73B0;&#x5728;&#x770B;&#x5230;&#x7ADF;&#x7136;&#x6CA1;&#x6709;&#x601D;&#x8DEF;&#xFF0C;&#x767E;&#x5EA6;&#x5230;&#x89E3;&#x7B54;&#x540E;&#x6211;&#x8BA4;&#x4E3A;&#x6211;&#x5FFD;&#x7565;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x9690;&#x542B;&#x6761;&#x4EF6;&#xFF0C;&#x90A3;&#x5C31;&#x662F;40,100,120&#x672C;&#x7684;&#x6982;&#x7387;&#x548C;&#x4E3A;1&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x90A3;&#x5C31;&#x662F;&#x53EA;&#x4F1A;&#x552E;&#x51FA;&#x8FD9;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4E0D;&#x4F1A;&#x552E;&#x51FA;41,101,119&#x672C;&#x7B49;&#x7B49;&#x7B49;&#x7B49;&#x7684;&#x60C5;&#x51B5;&#x3002;<br><img src="/2016/07/21/Correlation/school.png" alt="school"><br><img src="/2016/07/21/Correlation/deploy.png" alt=""><br>&#x89E3;&#x7B54;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#x6211;&#x53CD;&#x800C;&#x8BA4;&#x4E3A;&#x7B2C;&#x4E00;&#x79CD;&#x89E3;&#x91CA;&#x662F;&#x671F;&#x671B;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x770B;&#x6765;&#x8FD9;&#x9053;&#x9898;&#x8D77;&#x5230;&#x4E86;&#x53CD;&#x4F5C;&#x7528;&#x3002;<br>&#x63B7;&#x4E00;&#x6B21;&#x9AB0;&#x5B50;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x70B9;&#x7684;&#x671F;&#x671B;&#x662F;1/6<em>(6</em>(1+6)/2)=3.5&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x51FA;&#x73B0;&#x5C0F;&#x6570;&#x5462;&#xFF1F;<br>&#x5FAE;&#x7B11;&#x770B;&#x4E86;&#x534A;&#x5929;&#xFF0C;&#x8FD8;&#x662F;&#x6CA1;&#x89E3;&#x51B3;&#x6211;&#x7684;&#x95EE;&#x9898;&#x3002;<br>&#x6211;&#x53BB;&#x77E5;&#x4E4E;&#x793E;&#x533A;&#x67E5;&#x4E86;&#x67E5;&#xFF0C;&#x5F97;&#x5230;&#x5982;&#x4E0B;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x76F8;&#x5173;&#x56DE;&#x590D;&#x3002;<br>&#x6570;&#x5B66;&#x671F;&#x671B;&#x4E5F;&#x6709;&#x7FFB;&#x8BD1;&#x6210;&#x201D;&#x9884;&#x671F;&#x201C;&#x7684;&#xFF0C;&#x5728;&#x4E00;&#x4E9B;&#x7814;&#x7A76;&#x4E2D;&#xFF0C;&#x4F8B;&#x5982;&#x8D44;&#x4EA7;&#x5B9A;&#x4EF7;&#x7406;&#x8BBA;&#x91CC;&#xFF0C;&#x51E0;&#x4E4E;&#x662F;&#x628A;&#x8FD9;&#x4E2A;&#x6570;&#x5B66;&#x4E0A;&#x7684;&#x201D;&#x9884;&#x671F;&#x201C;&#x548C;&#x4EBA;&#x5FC3;&#x7406;&#x4E0A;&#x5BF9;&#x8D44;&#x4EA7;&#x4EF7;&#x683C;&#x7684;&#x201D;&#x9884;&#x671F;&#x201C;&#x7B49;&#x540C;&#x4E86;&#x3002;&#x4F46;&#x770B;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x6254;&#x4E00;&#x4E2A;&#x5747;&#x5300;&#x786C;&#x5E01;&#xFF0C;&#x6B63;&#x9762;+1&#x5206;&#x53CD;&#x9762;-1&#x5206;&#xFF0C;&#x5219;&#x6570;&#x5B66;&#x201C;&#x9884;&#x671F;&#x201D;&#x662F;0&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x53EA;&#x53EF;&#x80FD;&#x662F;+1&#x6216;&#x8005;-1&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x662F;0&#xFF0C;&#x81EA;&#x7136;&#x4E0D;&#x4F1A;&#x6709;&#x4EBA;&#x201D;&#x9884;&#x671F;&#x201C;&#x7ED3;&#x679C;&#x662F;0&#x5206;&#x3002;<br>&#x603B;&#x4E4B;&#xFF0C;&#x8C01;&#x80FD;&#x7ED9;&#x6570;&#x5B66;&#x671F;&#x671B;&#x4E00;&#x4E2A;&#x76F4;&#x89C9;&#x4E0A;&#x5BB9;&#x6613;&#x63A5;&#x53D7;&#x7684;&#x89E3;&#x91CA;&#x5417;&#xFF1F;</li>
<li>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x751C;&#x751C;&#x5708;&#x7684;&#x91CD;&#x5FC3;&#x4E5F;&#x4E0D;&#x5728;&#x751C;&#x751C;&#x5708;&#x91CC;&#x3002;</li>
<li>&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x7528;&#x6982;&#x7387;&#x8FDB;&#x884C;&#x52A0;&#x6743;&#x5F97;&#x5230;&#x7684;&#x9884;&#x671F;&#x3002;&#x5728;&#x5927;&#x91CF;&#x8BD5;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x7684;&#x5E73;&#x5747;&#x503C;&#x4F1A;&#x5411;&#x671F;&#x671B;&#x9760;&#x8FD1;&#x3002;</li>
<li>&#x5148;&#x4E0A;&#x603B;&#x7ED3;&#xFF0C;&#x671F;&#x671B;&#x662F;&#x57FA;&#x4E8E;&#x6982;&#x7387;&#x57FA;&#x7840;&#x7684;&#xFF0C;&#x662F;&#x5BF9;&#x672A;&#x77E5;&#x7684;&#x9884;&#x671F;&#x3002;TZ&#x5E94;&#x8BE5;&#x5206;&#x6E05;&#x695A;&#x4E00;&#x6B21;&#x7684;&#x5B9E;&#x9645;&#x7ED3;&#x679C;&#x548C;&#x4F60;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#x4E24;&#x8005;&#x7684;&#x533A;&#x522B;&#x3002;&#x4EE5;&#x79BB;&#x6563;&#x60C5;&#x51B5;&#x4E3A;&#x4F8B;&#x3002;       <img src="/2016/07/21/Correlation/lisan.png" alt=""><br>&#x4F60;&#x9996;&#x5148;&#x662F;&#x5DF2;&#x77E5;&#x5728;&#x6BCF;&#x4E00;&#x72B6;&#x6001;i&#x4E0B;&#x7684;&#x53D6;&#x503C;x<em>{i}&#xFF0C;&#x4EE5;&#x53CA;&#x6982;&#x7387;p</em>{i}&#x3002;&#x7136;&#x540E;&#x4F60;&#x624D;&#x80FD;&#x63A8;&#x65AD;&#x51FA;&#x671F;&#x671B;&#x3002;&#x800C;&#x6982;&#x7387;&#x5728;&#x5927;&#x591A;&#x51FA;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x7531;&#x9891;&#x6570;&#x8FD1;&#x4F3C;&#x800C;&#x6765;&#x7684;&#x3002;&#x9891;&#x6570;&#x5C31;&#x662F;&#x5728;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x6B21;&#x6570;/&#x5B9E;&#x9A8C;&#x7684;&#x603B;&#x6B21;&#x6570;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#x4E2D;&#xFF0C;&#x5C31;&#x5DF2;&#x7ECF;&#x9690;&#x85CF;&#x4E86;&#x5927;&#x6837;&#x672C;&#x7684;&#x6761;&#x4EF6;&#x4E86;&#x3002;&#x56E0;&#x800C;&#xFF0C;&#x671F;&#x671B;&#x5C31;&#x662F;&#x5728;&#x591A;&#x6B21;&#x5B9E;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x4F60;&#x4E0B;&#x4E00;&#x6B21;&#xFF0C;&#x6216;&#x8005;&#x67D0;&#x6B21;&#x5B9E;&#x9A8C;&#x7684;&#x7ED3;&#x679C;&#x3002;</li>
<li>&#x6837;&#x672C;&#x5BB9;&#x91CF;&#x7B49;&#x4E8E;&#x603B;&#x4F53;&#x65F6;&#x7684;&#x6982;&#x7387;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x671F;&#x671B;&#x662F;&#x6982;&#x7387;&#x4E0B;&#x7684;&#x503C;&#xFF0C;&#x4E0E;&#x67D0;&#x4E00;&#x6B21;&#x65E0;&#x5173;&#x3002;</li>
<li>&#x6211;&#x8BA4;&#x4E3A;@He Jingyu &#x7684;&#x7B54;&#x6848;&#x4E0D;&#x5B8C;&#x5168;&#x51C6;&#x786E;&#xFF0C;&#x5E76;&#x4E14;&#x7B2C;&#x4E00;&#x53E5;&#x5C31;&#x8BEF;&#x5BFC;&#x4E86;&#x77E5;&#x53CB;&#x3002;&#x671F;&#x671B;Expectation&#xFF0C;&#x662F;&#x7531;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x624B;&#x673A;&#x5C31;&#x4E0D;&#x7ED9;&#x516C;&#x5F0F;&#x4E86;&#x3002;&#x662F;&#x8BB2;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6240;&#x7B26;&#x5408;&#x7684;&#x5206;&#x5E03;&#x7684;&#x7279;&#x6027;&#x3002;&#x5747;&#x503C;Mean&#xFF0C;&#x662F;&#x6837;&#x672C;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5047;&#x8BBE;&#x4E00;&#x7EC4;&#x5206;&#x5E03;&#x672A;&#x77E5;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x5747;&#x503C;&#x4ECD;&#x7136;&#x662F;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x7684;&#x3002;&#x66F4;&#x6781;&#x7AEF;&#x4E00;&#x70B9;&#xFF0C;&#x8FD9;&#x51E0;&#x4E2A;&#x6837;&#x672C;&#x5206;&#x5E03;&#x7279;&#x6027;&#x5E76;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x6C42;&#x51FA;&#x5747;&#x503C;&#x3002;<br>&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x4F1A;&#x7ECF;&#x5E38;&#x6DF7;&#x6DC6;&#x5462;&#xFF1F;</li>
<li>&#x770B;&#x4E86;&#x5982;&#x4E0A;&#x7684;&#x56DE;&#x7B54;&#xFF0C;&#x90FD;&#x6CA1;&#x6709;&#x5F88;&#x672C;&#x8D28;&#x7684;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8BF8;&#x5982;&#x5E73;&#x5747;&#x554A;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x89C9;&#x5F97;&#x4E2D;&#x5B66;&#x751F;&#x90FD;&#x80FD;&#x7406;&#x89E3;&#xFF0C;&#x9898;&#x4E3B;&#x80AF;&#x5B9A;&#x4E5F;&#x660E;&#x767D;&#x3002;&#x3002;&#x57FA;&#x4E8E;&#x6211;&#x6B63;&#x5728;&#x73A9;&#x624B;&#x673A;&#xFF0C;&#x53EA;&#x80FD;&#x7B80;&#x5355;&#x8C08;&#x4E0B;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6570;&#x5B66;&#x671F;&#x671B;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5E73;&#x5747;&#x6570;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x3002;&#x4ECE;&#x7EDF;&#x8BA1;&#x89D2;&#x5EA6;&#xFF0C;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x6837;&#x672C;&#x7684;&#x65E0;&#x504F;&#x4F30;&#x8BA1;&#x3002;&#x4ECE;&#x6982;&#x7387;&#x89D2;&#x5EA6;&#xFF0C;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E8B;&#x4EF6;&#x7684;&#x96C6;&#x5408;&#xFF0C;sigma&#x57DF;&#xFF0C;&#x6D4B;&#x5EA6;&#x7B49;&#x3002;&#x671F;&#x671B;&#x8FD9;&#x4E2A;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x5C31;&#x662F;&#x5404;&#x4E2A;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x5728;&#x5176;&#x751F;&#x6210;sigma&#x57DF;&#x4E0A;&#x7684;&#x6700;&#x4F73;&#x903C;&#x8FD1;&#x5143;&#x3002;<br>&#x5FAE;&#x7B11;&#x611F;&#x89C9;&#x77E5;&#x4E4E;&#x5C31;&#x662F;&#x5C5E;&#x4E8E;&#x9AD8;&#x7AEF;&#x793E;&#x533A;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x53D1;&#x7684;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x89C1;&#x89E3;&#xFF0C;&#x4E0D;&#x662F;ctrl+c&#x548C;ctrl+v&#x3002;<br>&#x5FAE;&#x7B11;&#x6211;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F88;&#x5E7C;&#x7A1A;&#x5417;&#xFF1F;&#x6211;&#x4E0D;&#x8FD9;&#x4E48;&#x8BA4;&#x4E3A;&#xFF0C;&#x770B;PCA&#x548C;LDA&#x65F6;&#x6211;&#x67E5;&#x770B;&#x4E86;&#x77E9;&#x9635;&#xFF0C;&#x53D1;&#x73B0;Google&#x628A;CSDN&#x7684;&#x4E00;&#x4E2A;MVP&#x548C;&#x77E9;&#x9635;&#x8054;&#x7CFB;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#xFF0C;&#x6587;&#x7AE0;&#x53EB;&#x300A;&#x7406;&#x89E3;&#x77E9;&#x9635;&#x300B;&#xFF0C;&#x628A;&#x77E9;&#x9635;&#x770B;&#x6210;&#x4E00;&#x79CD;&#x53D8;&#x6362;&#xFF0C;&#x5171;&#x4E09;&#x7247;&#xFF0C;&#x524D;&#x540E;&#x82B1;&#x4E86;2&#x5E74;&#x65F6;&#x95F4;&#x5B8C;&#x6210;(ps:&#x770B;&#x5B8C;&#x4E4B;&#x540E;&#x6211;&#x8FD8;&#x662F;&#x4E0D;&#x592A;&#x7406;&#x89E3;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x65B9;&#x5DEE;&#x4EC0;&#x4E48;&#x7684;&#x4E0D;&#x77E5;&#x9053;&#x5176;&#x5DE5;&#x7A0B;&#x610F;&#x4E49;)&#x3002;&#x8FD9;&#x4E24;&#x8005;&#x4E0D;&#x662F;&#x5F88;&#x76F8;&#x4F3C;&#x4E48;&#xFF1F;</li>
</ol>
<h3 id="&#x76AE;&#x5C14;&#x900A;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x7684;&#x7406;&#x89E3;"><a href="#&#x76AE;&#x5C14;&#x900A;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x7684;&#x7406;&#x89E3;" class="headerlink" title="&#x76AE;&#x5C14;&#x900A;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x7684;&#x7406;&#x89E3;"></a>&#x76AE;&#x5C14;&#x900A;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x7684;&#x7406;&#x89E3;</h3><p>&#x6211;&#x60F3;&#x77E5;&#x9053;&#x7684;&#x662F;&#x76AE;&#x5C14;&#x900A;&#x516C;&#x5F0F;&#x4E3A;&#x4E3A;&#x4EC0;&#x4E48;&#x503C;&#x57DF;&#x5728;-1&#x5230;1(&#x600E;&#x4E48;&#x53EA;&#x7BA1;&#x770B;&#x51FA;&#x6765;&#x6216;&#x8005;&#x7406;&#x89E3;&#x51FA;&#x6765;)&#xFF0C;&#x516C;&#x5F0F;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8868;&#x8FBE;&#xFF1F;&#x53EA;&#x6709;&#x7406;&#x89E3;&#x4E86;&#xFF0C;&#x624D;&#x80FD;&#x63D0;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x516C;&#x5F0F;&#x3002;<br>&#x6211;&#x60F3;&#x8D77;&#x4E86;&#x9AD8;&#x4E2D;&#x7269;&#x7406;&#x8BDD;U-I&#x56FE;&#xFF0C;&#x8001;&#x5E08;&#x8BF4;&#x6700;&#x63A5;&#x8FD1;&#x4E24;&#x904D;&#x70B9;&#x7684;&#x76F4;&#x7EBF;&#xFF0C;&#x5927;&#x5B66;&#x4E86;&#x77E5;&#x9053;&#x662F;&#x6700;&#x5C0F;&#x4E8C;&#x4E58;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x5C0F;&#x4E8C;&#x4E58;&#x5F97;&#x51FA;&#x7684;&#x76F4;&#x7EBF;&#x4E24;&#x4FA7;&#x7684;&#x70B9;&#x7684;&#x76AE;&#x5C14;&#x900A;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x5E94;&#x8BE5;&#x4E0E;&#x76F4;&#x7EBF;&#x7684;&#x659C;&#x7387;&#x6709;&#x67D0;&#x79CD;&#x8054;&#x7CFB;&#x5427;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5EA6;&#x91CF;&#x53E6;&#x4E00;&#x4E2A;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x6570;&#x5B66;&#x5927;&#x795E;&#x8BF7;&#x5173;&#x6CE8;&#x3002;<br>&#x5FAE;&#x7B11;&#x5F53;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x6807;&#x51C6;&#x5DEE;&#x90FD;&#x4E0D;&#x4E3A;&#x96F6;&#x65F6;&#xFF0C;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x624D;&#x6709;&#x5B9A;&#x4E49;&#xFF0C;&#x76AE;&#x5C14;&#x900A;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x9002;&#x7528;&#x4E8E;&#xFF1A;</p>
<ol>
<li>&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x662F;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#xFF0C;&#x90FD;&#x662F;&#x8FDE;&#x7EED;&#x6570;&#x636E;&#x3002;</li>
<li>&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x603B;&#x4F53;&#x662F;&#x6B63;&#x6001;&#x5206;&#x5E03;&#xFF0C;&#x6216;&#x63A5;&#x8FD1;&#x6B63;&#x6001;&#x7684;&#x5355;&#x5CF0;&#x5206;&#x5E03;&#x3002;</li>
<li>&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x89C2;&#x6D4B;&#x503C;&#x662F;&#x6210;&#x5BF9;&#x7684;&#xFF0C;&#x6BCF;&#x5BF9;&#x89C2;&#x6D4B;&#x503C;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x3002;<br>&#x4ECE;&#x4E0A;&#x9762;&#x770B;&#x51FA;&#xFF0C;&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x662F;&#x4E0D;&#x662F;&#x4E0D;&#x8BE5;&#x7528;&#x76AE;&#x5C14;&#x900A;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#xFF0C;&#x9664;&#x4E86;&#x7B2C;&#x4E8C;&#x4E2A;&#x6761;&#x4EF6;&#x4E0D;&#x786E;&#x5B9A;(&#x83AB;&#x975E;&#x6BCF;&#x4E2A;&#x7269;&#x54C1;&#x88AB;&#x8D2D;&#x4E70;&#x7684;&#x603B;&#x6570;&#x670D;&#x4ECE;&#x6B63;&#x6001;&#x5206;&#x5E03;)&#x3002;<br>&#x5FAE;&#x7B11;Matlab&#x91CC;&#x4F7F;&#x7528;corr(x,y)&#x51FD;&#x6570;&#x3002;<br>&#x5FAE;&#x7B11;&#x5B9A;&#x7406;&#xFF1A; | &#x3C1;XY | = 1&#x7684;&#x5145;&#x8981;&#x6761;&#x4EF6;&#x662F;&#xFF0C;&#x5B58;&#x5728;&#x5E38;&#x6570;a&#xFF0C;b&#xFF0C;&#x4F7F;&#x5F97;P{Y=a+bX}=1&#xFF1B;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x76AE;&#x5C14;&#x900A;&#x8861;&#x91CF;&#x7684;&#x662F;&#x4E24;&#x7EC4;&#x6570;&#x636E;&#x7684;&#x7EBF;&#x6027;&#x76F8;&#x5173;&#x7A0B;&#x5EA6;&#x3002;<br>&#x5FAE;&#x7B11;&#x9700;&#x8981;&#x6307;&#x51FA;&#x7684;&#x662F;&#xFF0C;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x6709;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x5373;&#x5B83;&#x63A5;&#x8FD1;&#x4E8E;1&#x7684;&#x7A0B;&#x5EA6;&#x4E0E;&#x6570;&#x636E;&#x7EC4;&#x6570;n&#x76F8;&#x5173;&#xFF0C;&#x8FD9;&#x5BB9;&#x6613;&#x7ED9;&#x4EBA;&#x4E00;&#x79CD;&#x5047;&#x8C61;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x5F53;n&#x8F83;&#x5C0F;&#x65F6;&#xFF0C;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x7684;&#x6CE2;&#x52A8;&#x8F83;&#x5927;&#xFF0C;&#x5BF9;&#x6709;&#x4E9B;&#x6837;&#x672C;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x6613;&#x63A5;&#x8FD1;&#x4E8E;1&#xFF1B;&#x5F53;n&#x8F83;&#x5927;&#x65F6;&#xFF0C;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x5BB9;&#x6613;&#x504F;&#x5C0F;&#x3002;&#x7279;&#x522B;&#x662F;&#x5F53;n=2&#x65F6;&#xFF0C;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x603B;&#x4E3A;1&#x3002;&#x56E0;&#x6B64;&#x5728;&#x6837;&#x672C;&#x5BB9;&#x91CF;n&#x8F83;&#x5C0F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4EC5;&#x51ED;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x8F83;&#x5927;&#x5C31;&#x5224;&#x5B9A;&#x53D8;&#x91CF;x&#x4E0E;y&#x4E4B;&#x95F4;&#x6709;&#x5BC6;&#x5207;&#x7684;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#x662F;&#x4E0D;&#x59A5;&#x5F53;&#x7684;&#x3002;<br>&#x8FD9;&#x662F;14&#x53F7;&#x8865;&#x5145;&#x4E0A;&#x53BB;&#x7684;&#x3002;<br>&#x6309;&#x7167;&#x9AD8;&#x4E2D;&#x6570;&#x5B66;&#x6C34;&#x5E73;&#x6765;&#x7406;&#x89E3;, &#x5B83;&#x5F88;&#x7B80;&#x5355;, &#x53EF;&#x4EE5;&#x770B;&#x505A;&#x5C06;&#x4E24;&#x7EC4;&#x6570;&#x636E;&#x9996;&#x5148;&#x505A;Z&#x5206;&#x6570;&#x5904;&#x7406;&#x4E4B;&#x540E;, &#x7136;&#x540E;&#x4E24;&#x7EC4;&#x6570;&#x636E;&#x7684;&#x4E58;&#x79EF;&#x548C;&#x9664;&#x4EE5;&#x6837;&#x672C;&#x6570;&#x3002;Z&#x5206;&#x6570;&#x4E00;&#x822C;&#x4EE3;&#x8868;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x4E2D;, &#x6570;&#x636E;&#x504F;&#x79BB;&#x4E2D;&#x5FC3;&#x70B9;&#x7684;&#x8DDD;&#x79BB;.&#x7B49;&#x4E8E;&#x53D8;&#x91CF;&#x51CF;&#x6389;&#x5E73;&#x5747;&#x6570;&#x518D;&#x9664;&#x4EE5;&#x6807;&#x51C6;&#x5DEE;.(&#x5C31;&#x662F;&#x9AD8;&#x8003;&#x7684;&#x6807;&#x51C6;&#x5206;&#x7C7B;&#x4F3C;&#x7684;&#x5904;&#x7406;)&#x3002;&#x6807;&#x51C6;&#x5DEE;&#x5219;&#x7B49;&#x4E8E;&#x53D8;&#x91CF;&#x51CF;&#x6389;&#x5E73;&#x5747;&#x6570;&#x7684;&#x5E73;&#x65B9;&#x548C;,&#x518D;&#x9664;&#x4EE5;&#x6837;&#x672C;&#x6570;,&#x6700;&#x540E;&#x518D;&#x5F00;&#x65B9;.&#x6240;&#x4EE5;, &#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x6700;&#x6734;&#x7D20;&#x7684;&#x7406;&#x89E3;,&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x516C;&#x5F0F;&#x4F9D;&#x6B21;&#x7CBE;&#x7B80;&#x4E3A;:<br>Z&#x503C;&#x7684;&#x91CF;&#x4EE3;&#x8868;&#x7740;&#x539F;&#x59CB;&#x5206;&#x6570;&#x548C;&#x6BCD;&#x4F53;&#x5E73;&#x5747;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x662F;&#x4EE5;&#x6807;&#x51C6;&#x5DEE;&#x4E3A;&#x5355;&#x4F4D;&#x8BA1;&#x7B97;&#x3002;&#x5728;&#x539F;&#x59CB;&#x5206;&#x6570;&#x4F4E;&#x4E8E;&#x5E73;&#x5747;&#x503C;&#x65F6;Z&#x5219;&#x4E3A;&#x8D1F;&#x6570;&#xFF0C;&#x53CD;&#x4E4B;&#x5219;&#x4E3A;&#x6B63;&#x6570;&#x3002;&#x6807;&#x51C6;&#x5206;&#x6570;&#x53EF;&#x4EE5;&#x56DE;&#x7B54;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x201D;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x5206;&#x6570;&#x8DDD;&#x79BB;&#x5E73;&#x5747;&#x6570;&#x591A;&#x5C11;&#x4E2A;&#x6807;&#x51C6;&#x5DEE;?&#x201D;&#x5728;&#x5E73;&#x5747;&#x6570;&#x4E4B;&#x4E0A;&#x7684;&#x5206;&#x6570;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6B63;&#x7684;&#x6807;&#x51C6;&#x5206;&#x6570;&#xFF0C;&#x5728;&#x5E73;&#x5747;&#x6570;&#x4E4B;&#x4E0B;&#x7684;&#x5206;&#x6570;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8D1F;&#x7684;&#x6807;&#x51C6;&#x5206;&#x6570;&#x3002;<br>&#x6807;&#x51C6;&#x5206;&#x6570;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x67D0;&#x5206;&#x6570;&#x5728;&#x5206;&#x5E03;&#x4E2D;&#x76F8;&#x5BF9;&#x4F4D;&#x7F6E;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6807;&#x51C6;&#x5206;&#x6570;&#x80FD;&#x591F;&#x771F;&#x5B9E;&#x7684;&#x53CD;&#x5E94;&#x4E00;&#x4E2A;&#x5206;&#x6570;&#x8DDD;&#x79BB;&#x5E73;&#x5747;&#x6570;&#x7684;&#x76F8;&#x5BF9;&#x6807;&#x51C6;&#x8DDD;&#x79BB;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A;&#x6BCF;&#x4E00;&#x4E2A;&#x5206;&#x6570;&#x90FD;&#x8F6C;&#x6362;&#x6210;&#x6807;&#x51C6;&#x5206;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x5206;&#x6570;&#x4F1A;&#x4EE5;&#x6807;&#x51C6;&#x5DEE;&#x4E3A;&#x5355;&#x4F4D;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x5206;&#x6570;&#x5230;&#x5E73;&#x5747;&#x6570;&#x7684;&#x8DDD;&#x79BB;&#x6216;&#x79BB;&#x5DEE;&#x3002;&#x5C06;&#x6210;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x539F;&#x59CB;&#x5206;&#x6570;&#x8F6C;&#x6362;&#x4E3A;&#x6807;&#x51C6;&#x5206;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x67E5;&#x9605;&#x6807;&#x51C6;&#x5206;&#x6570;&#x5728;&#x6B63;&#x6001;&#x66F2;&#x7EBF;&#x4E0B;&#x9762;&#x79EF;&#x7684;&#x8868;&#x683C;&#x6765;&#x5F97;&#x77E5;&#x5E73;&#x5747;&#x6570;&#x4E0E;&#x6807;&#x51C6;&#x5206;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x9762;&#x79EF;&#xFF0C;&#x8FDB;&#x800C;&#x5F97;&#x77E5;&#x539F;&#x59CB;&#x5206;&#x6570;&#x5728;&#x6570;&#x636E;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x767E;&#x5206;&#x7B49;&#x7EA7;&#x3002;<br>&#x4E00;&#x4E2A;&#x6570;&#x5217;&#x7684;&#x5404;&#x6807;&#x51C6;&#x5206;&#x6570;&#x7684;&#x5E73;&#x65B9;&#x548C;&#x7B49;&#x4E8E;&#x8BE5;&#x6570;&#x5217;&#x6570;&#x636E;&#x7684;&#x4E2A;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x6807;&#x51C6;&#x5206;&#x6570;&#x7684;&#x6807;&#x51C6;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x90FD;&#x4E3A;1&#x3002;&#x5747;&#x503C;&#x4E3A;0&#x3002;<br>&#x4F8B;&#x5982;&#xFF1A;&#x67D0;&#x4E2D;&#x5B66;&#x9AD8;&#xFF08;1&#xFF09;&#x73ED;&#x671F;&#x672B;&#x8003;&#x8BD5;&#xFF0C;&#x5DF2;&#x77E5;&#x8BED;&#x6587;&#x671F;&#x672B;&#x8003;&#x8BD5;&#x7684;&#x5168;&#x73ED;&#x5E73;&#x5747;&#x5206;&#x4E3A;73&#x5206;&#xFF0C;&#x6807;&#x51C6;&#x5DEE;&#x4E3A;7&#x5206;&#xFF0C;&#x7532;&#x5F97;&#x4E86;78&#x5206;&#xFF1B;&#x6570;&#x5B66;&#x671F;&#x672B;&#x8003;&#x8BD5;&#x7684;&#x5168;&#x73ED;&#x5E73;&#x5747;&#x5206;&#x4E3A;80&#x5206;&#xFF0C;&#x6807;&#x51C6;&#x5DEE;&#x4E3A;6.5&#x5206;&#xFF0C;&#x7532;&#x5F97;&#x4E86;83&#x5206;&#x3002;&#x7532;&#x54EA;&#x4E00;&#x95E8;&#x8003;&#x8BD5;&#x6210;&#x7EE9;&#x6BD4;&#x8F83;&#x597D;&#xFF1F;<br>&#x56E0;&#x4E3A;&#x4E24;&#x79D1;&#x671F;&#x672B;&#x8003;&#x8BD5;&#x7684;&#x6807;&#x51C6;&#x5DEE;&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x80FD;&#x7528;&#x539F;&#x59CB;&#x5206;&#x6570;&#x76F4;&#x63A5;&#x6BD4;&#x8F83;&#x3002;&#x9700;&#x8981;&#x5C06;&#x539F;&#x59CB;&#x5206;&#x6570;&#x8F6C;&#x6362;&#x6210;&#x6807;&#x51C6;&#x5206;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;Z(&#x8BED;&#x6587;)=(78-73)/7=0.71 Z(&#x6570;&#x5B66;)=(83-80)/6.5=0.46 &#x3000;&#x7532;&#x7684;&#x8BED;&#x6587;&#x6210;&#x7EE9;&#x5728;&#x5176;&#x6574;&#x4F53;&#x5206;&#x5E03;&#x4E2D;&#x4F4D;&#x4E8E;&#x5E73;&#x5747;&#x5206;&#x4E4B;&#x4E0A;0.71&#x4E2A;&#x6807;&#x51C6;&#x5DEE;&#x7684;&#x5730;&#x4F4D;&#xFF0C;&#x4ED6;&#x7684;&#x6570;&#x5B66;&#x6210;&#x7EE9;&#x5728;&#x5176;&#x6574;&#x4F53;&#x5206;&#x5E03;&#x4E2D;&#x4F4D;&#x4E8E;&#x5E73;&#x5747;&#x5206;&#x4E4B;&#x4E0A;0.46&#x4E2A;&#x6807;&#x51C6;&#x5DEE;&#x7684;&#x5730;&#x4F4D;&#x3002;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF0C;&#x7532;&#x7684;&#x8BED;&#x6587;&#x671F;&#x672B;&#x8003;&#x8BD5;&#x6210;&#x7EE9;&#x4F18;&#x4E8E;&#x6570;&#x5B66;&#x671F;&#x672B;&#x8003;&#x8BD5;&#x6210;&#x7EE9;&#x3002;<br>&#x7531;&#x4E8E;&#x6807;&#x51C6;&#x5206;&#x6570;&#x4E0D;&#x4EC5;&#x80FD;&#x8868;&#x660E;&#x539F;&#x59CB;&#x5206;&#x6570;&#x5728;&#x5206;&#x5E03;&#x4E2D;&#x7684;&#x5730;&#x4F4D;&#xFF0C;&#x5B83;&#x8FD8;&#x662F;&#x4EE5;&#x6807;&#x51C6;&#x5DEE;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x7B49;&#x8DDD;&#x91CF;&#x8868;&#xFF0C;&#x6545;&#x7ECF;&#x8FC7;&#x628A;&#x539F;&#x59CB;&#x5206;&#x6570;&#x8F6C;&#x5316;&#x4E3A;&#x6807;&#x51C6;&#x5206;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#x7684;&#x5404;&#x539F;&#x59CB;&#x5206;&#x6570;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;<h3 id="&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;"><a href="#&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;" class="headerlink" title="&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;"></a>&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;</h3>&#x5BF9;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x4E0D;&#x662F;&#x5F88;&#x4E86;&#x89E3;&#x7684;&#x8BF7;&#x770B;&#x7B14;&#x8005;&#x8FD9;&#x4E00;&#x7BC7;(&#x8D85;&#x94FE;&#x63A5;)&#x3002;<br>&#x57FA;&#x4E8E;&#x7528;&#x6237;&#xFF08;User-Based&#xFF09;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;&#x9996;&#x5148;&#x8981;&#x6839;&#x636E;&#x7528;&#x6237;&#x5386;&#x53F2;&#x884C;&#x4E3A;&#x4FE1;&#x606F;&#xFF0C;&#x5BFB;&#x627E;&#x4E0E;&#x65B0;&#x7528;&#x6237;&#x76F8;&#x4F3C;&#x7684;&#x5176;&#x4ED6;&#x7528;&#x6237;&#xFF1B;&#x540C;&#x65F6;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x76F8;&#x4F3C;&#x7528;&#x6237;&#x5BF9;&#x5176;&#x4ED6;&#x9879;&#x7684;&#x8BC4;&#x4EF7;&#x4FE1;&#x606F;&#x9884;&#x6D4B;&#x5F53;&#x524D;&#x65B0;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x559C;&#x6B22;&#x7684;&#x9879;&#x3002;&#x7ED9;&#x5B9A;&#x7528;&#x6237;&#x8BC4;&#x5206;&#x6570;&#x636E;&#x77E9;&#x9635;R&#xFF0C;&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x76F8;&#x4F3C;&#x5EA6;&#x51FD;&#x6570;s:U&#xD7;U&#x2192;R&#xFF0C;&#x4EE5;&#x8BA1;&#x7B97;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x8BC4;&#x5206;&#x6570;&#x636E;&#x548C;&#x76F8;&#x4F3C;&#x77E9;&#x9635;&#x8BA1;&#x7B97;&#x63A8;&#x8350;&#x7ED3;&#x679C;&#x3002;<br>&#x5728;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x73AF;&#x8282;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x4E24;&#x79CD;&#x76F8;&#x4F3C;&#x5EA6;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x5305;&#x62EC;&#x76AE;&#x5C14;&#x900A;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x548C;&#x4F59;&#x5F26;&#x76F8;&#x4F3C;&#x5EA6;&#x7B49;&#x3002;<br>&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x80FD;&#x7528;&#x5728;&#x57FA;&#x4E8E;&#x7269;&#x54C1;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;&#x91CC;&#x4E48;&#xFF1F;&#x7B14;&#x8005;&#x8BA4;&#x4E3A;&#x4E0D;&#x80FD;&#xFF0C;&#x4E3A;&#x4EC0;&#x5462;&#xFF1F;&#x8BF7;&#x601D;&#x8003;&#x8BE5;&#x4ECE;&#x54EA;&#x5F97;&#x5230;&#x5173;&#x4E8E;&#x7269;&#x54C1;&#x7684;&#x4E24;&#x7EC4;&#x5411;&#x91CF;&#x5462;&#xFF1F;&#x7269;&#x54C1;&#x9876;&#x591A;&#x662F;&#x9500;&#x552E;&#x4E86;&#x591A;&#x5C11;&#xFF0C;&#x8981;&#x54CD;&#x4EAE;&#x7684;&#x8BDD;&#x5FC5;&#x987B;&#x8981;&#x548C;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5374;&#x4ECE;&#x6CA1;&#x89C1;&#x8FC7;&#x6709;&#x4EBA;&#x8FD9;&#x4E48;&#x7528;&#xFF0C;&#x54C8;&#x54C8;&#x3002;<br>&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x73AF;&#x8282;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x7528;&#x6237;u&#x5BF9;&#x672A;&#x8BC4;&#x5206;&#x5546;&#x54C1;&#x7684;&#x9884;&#x6D4B;&#x5206;&#x503C;&#x3002;&#x9996;&#x5148;&#x6839;&#x636E;&#x4E0A;&#x4E00;&#x6B65;&#x4E2D;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x8BA1;&#x7B97;&#xFF0C;&#x5BFB;&#x627E;&#x7528;&#x6237;u&#x7684;&#x90BB;&#x5C45;&#x96C6;N&#x2208;U, &#x5176;&#x4E2D;N&#x8868;&#x793A;&#x90BB;&#x5C45;&#x96C6;&#xFF0C;U&#x8868;&#x793A;&#x7528;&#x6237;&#x96C6;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x7ED3;&#x5408;&#x7528;&#x6237;&#x8BC4;&#x5206;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x9884;&#x6D4B;&#x7528;&#x6237;u&#x5BF9;&#x9879;i&#x7684;&#x8BC4;&#x5206;&#xFF0C;&#x8BA1;&#x7B97;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;<br><img src="/2016/07/21/Correlation/user2item.png" alt=""><br>&#x6211;&#x5BF9;&#x4E8E;&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x7684;&#x7406;&#x89E3;&#xFF1A;&#x7528;&#x6237;u&#x5BF9;&#x672A;&#x8D2D;&#x4E70;&#x7684;&#x7269;&#x54C1;j&#x7684;&#x8BC4;&#x5206;&#x4E3A;&#x7528;&#x6237;u&#x5BF9;&#x9664;&#x4E86;j&#x4EE5;&#x5916;&#x7684;&#x7269;&#x54C1;&#x96C6;{N-j}&#x8BC4;&#x5206;&#x7684;&#x5747;&#x503C;(&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x5982;&#x679C;u&#x8FD8;&#x5BF9;N&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x7269;&#x54C1;&#x6CA1;&#x8BC4;&#x5206;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x7B14;&#x8005;&#x7684;&#x90A3;&#x4E00;&#x7247;&#x6587;&#x7AE0;&#x7528;&#x7684;&#x662F;0&#x8868;&#x793A;&#xFF0C;&#x4E0D;&#x8FC7;&#x7B14;&#x8005;&#x76F4;&#x89C2;&#x7684;&#x611F;&#x89C9;&#x662F;&#x5E94;&#x8BE5;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x6709;&#x6548;&#x7B97;&#x6CD5;&#xFF0C;&#x7D27;&#x90BB;&#x4E0B;&#x6587;&#x7684;&#x6B65;&#x9AA4;&#x4E00;(&#x5BFB;&#x627E;&#x7528;&#x6237;C&#x7684;&#x90BB;&#x5C45;)&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x8BDD;&#x4E0D;&#x7528;&#x8BE5;&#x6570;&#x636E;&#xFF0C;&#x54CE;&#x54CE;&#x54CE;&#xFF0C;&#x771F;&#x4E0D;&#x4E25;&#x8C28;)&#x52A0;&#x4E0A;&#x4EE5;TopK&#x7528;&#x6237;u&#x2019;&#x4E0E;&#x7528;&#x6237;u&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x6765;&#x52A0;&#x6743;&#x5E73;&#x5747;&#x7528;&#x6237;u&#x2019;&#x5BF9;j&#x7684;&#x8BC4;&#x5206;&#x4E0E;&#x7528;&#x6237;u&#x2019;&#x8BC4;&#x5206;&#x7684;&#x5747;&#x503C;&#x4E4B;&#x5DEE;&#x3002;<br>&#x7B14;&#x8005;&#x611F;&#x89C9;&#x7B14;&#x8005;&#x5199;&#x7684;&#x4E0A;&#x9762;&#x7684;&#x53E5;&#x5B50;&#x597D;&#x7E41;&#x7410;&#xFF0C;&#x534A;&#x5E74;&#x8FC7;&#x540E;&#xFF0C;&#x7B14;&#x8005;&#x6CA1;&#x6709;&#x4FE1;&#x5FC3;&#x4EC5;&#x4EC5;&#x6839;&#x636E;&#x8FD9;&#x53E5;&#x8BDD;&#x5199;&#x51FA;&#x516C;&#x5F0F;&#xFF0C;&#x54C8;&#x54C8;&#x3002;<br>&#x8FD9;&#x4E2A;&#x56FE;&#x4E0D;&#x592A;&#x6E05;&#x6670;&#xFF0C;&#x4E0D;&#x8FC7;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x770B;&#x662F;&#x5426;&#x5E26;&#x6487;&#xFF0C;&#x7136;&#x540E;&#x7ED3;&#x5408;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x770B;&#x5B8C;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x6211;&#x77E5;&#x9053;&#x6211;&#x90A3;&#x7BC7;&#x6587;&#x7AE0;&#x4E3A;&#x4EC0;&#x4E48;&#x9519;&#x4E86;&#xFF0C;&#x5C31;&#x5728;&#x4E8E;&#x6211;&#x6700;&#x540E;&#x6C42;&#x63A8;&#x8350;&#x7269;&#x54C1;&#x7684;&#x6B21;&#x5E8F;&#x662F;&#x76F4;&#x63A5;&#x628A;TopK&#x7528;&#x6237;&#x4E2D;&#x4E70;&#x8FC7;&#x8FD9;&#x4EF6;&#x7269;&#x54C1;&#x7684;&#x7528;&#x6237;&#x4E0E;&#x5F85;&#x88AB;&#x63A8;&#x8350;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x5173;&#x6027;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x6392;&#x5E8F;&#x4E86;&#x3002;<br>&#x5176;&#x4E2D;&#xFF0C;s(u, u&#x2019;)&#x8868;&#x793A;&#x7528;&#x6237;u&#x548C;&#x7528;&#x6237;u&#x2019;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x3002;<br>&#x5047;&#x8BBE;&#x6709;&#x5982;&#x4E0B;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x8BC4;&#x5206;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x9884;&#x6D4B;&#x7528;&#x6237;C&#x5BF9;&#x5546;&#x54C1;4&#x7684;&#x8BC4;&#x5206;</li>
</ol>
<table>
<thead>
<tr>
<th style="text-align:left">&#x7528;&#x6237;</th>
<th style="text-align:left">&#x5546;&#x54C1;1</th>
<th style="text-align:left">&#x5546;&#x54C1;2</th>
<th style="text-align:left">&#x5546;&#x54C1;3</th>
<th style="text-align:left">&#x5546;&#x54C1;4</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">&#x7528;&#x6237;A</td>
<td style="text-align:left">4</td>
<td style="text-align:left">?</td>
<td style="text-align:left">3</td>
<td style="text-align:left">5</td>
</tr>
<tr>
<td style="text-align:left">&#x7528;&#x6237;B</td>
<td style="text-align:left">?</td>
<td style="text-align:left">5</td>
<td style="text-align:left">4</td>
<td style="text-align:left">?</td>
</tr>
<tr>
<td style="text-align:left">&#x7528;&#x6237;C</td>
<td style="text-align:left">5</td>
<td style="text-align:left">4</td>
<td style="text-align:left">2</td>
<td style="text-align:left">?</td>
</tr>
<tr>
<td style="text-align:left">&#x7528;&#x6237;D</td>
<td style="text-align:left">2</td>
<td style="text-align:left">4</td>
<td style="text-align:left">?</td>
<td style="text-align:left">3</td>
</tr>
<tr>
<td style="text-align:left">&#x7528;&#x6237;E</td>
<td style="text-align:left">3</td>
<td style="text-align:left">4</td>
<td style="text-align:left">5</td>
<td style="text-align:left">?</td>
</tr>
</tbody>
</table>
<p>&#x8868;&#x4E2D;? &#x8868;&#x793A;&#x8BC4;&#x5206;&#x672A;&#x77E5;&#x3002;&#x6839;&#x636E;&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;&#x6B65;&#x9AA4;&#xFF0C;&#x8BA1;&#x7B97;&#x7528;&#x6237;C&#x5BF9;&#x5546;&#x54C1;4&#x7684;&#x8BC4;&#x5206;&#xFF0C;&#x5176;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<ul>
<li>&#x5BFB;&#x627E;&#x7528;&#x6237;C&#x7684;&#x90BB;&#x5C45;<br>&#x4ECE;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x53EA;&#x6709;&#x7528;&#x6237;A&#x548C;&#x7528;&#x6237;D&#x5BF9;&#x5546;&#x54C1;4&#x8BC4;&#x8FC7;&#x5206;&#xFF0C;&#x56E0;&#x6B64;&#x5019;&#x9009;&#x90BB;&#x5C45;&#x53EA;&#x6709;2&#x4E2A;&#xFF0C;&#x5206;&#x522B;&#x4E3A;&#x7528;&#x6237;A&#x548C;&#x7528;&#x6237;D&#x3002;&#x7528;&#x6237;A&#x7684;&#x5E73;&#x5747;&#x8BC4;&#x5206;&#x4E3A;4&#xFF0C;&#x7528;&#x6237;C&#x7684;&#x5E73;&#x5747;&#x8BC4;&#x5206;&#x4E3A;3.667&#xFF0C;&#x7528;&#x6237;D&#x7684;&#x5E73;&#x5747;&#x8BC4;&#x5206;&#x4E3A;3&#x3002;&#x6839;&#x636E;&#x76AE;&#x5C14;&#x900A;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x516C;&#x5F0F;&#x6765;&#x770B;&#xFF0C;&#x7528;&#x6237;C&#x548C;&#x7528;&#x6237;A&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x4E3A;&#xFF1A;<br><img src="/2016/07/21/Correlation/xiangsidu.png" alt=""><br>&#x540C;&#x7406;&#xFF0C;s(C, D) =-0.515&#x3002;</li>
<li>&#x9884;&#x6D4B;&#x7528;&#x6237;C&#x5BF9;&#x5546;&#x54C1;4&#x7684;&#x8BC4;&#x5206;<br>&#x6839;&#x636E;&#x4E0A;&#x8FF0;&#x8BC4;&#x5206;&#x9884;&#x6D4B;&#x516C;&#x5F0F;&#xFF0C;&#x8BA1;&#x7B97;&#x7528;&#x6237;C&#x5BF9;&#x5546;&#x54C1;4&#x7684;&#x8BC4;&#x5206;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;<br><img src="/2016/07/21/Correlation/tuicepingfen.png" alt=""><br>&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x51FA;&#x5176;&#x4ED6;&#x672A;&#x77E5;&#x7684;&#x8BC4;&#x5206;&#x3002;<h3 id="&#x57FA;&#x4E8E;&#x7269;&#x54C1;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;"><a href="#&#x57FA;&#x4E8E;&#x7269;&#x54C1;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;" class="headerlink" title="&#x57FA;&#x4E8E;&#x7269;&#x54C1;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;"></a>&#x57FA;&#x4E8E;&#x7269;&#x54C1;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;</h3>&#x57FA;&#x4E8E;&#x9879;&#x76EE;&#xFF08;Item-Based&#xFF09;&#x7684;&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;&#x662F;&#x5E38;&#x89C1;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x7B97;&#x6CD5;&#x3002;&#x4E0E;User-Based&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x662F;&#xFF0C;Item-Based &#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;&#x8BA1;&#x7B97;Item&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x4ECE;&#x800C;&#x9884;&#x6D4B;&#x7528;&#x6237;&#x8BC4;&#x5206;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8BE5;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x9884;&#x5148;&#x8BA1;&#x7B97;Item&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;Item-Based&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x7528;&#x6237;&#x8BC4;&#x5206;&#x6570;&#x636E;&#x548C;&#x8BA1;&#x7B97;&#x7684;Item&#x76F8;&#x4F3C;&#x5EA6;&#x77E9;&#x9635;&#xFF0C;&#x4ECE;&#x800C;&#x5BF9;&#x76EE;&#x6807;Item&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x7684;&#x3002;<br>&#x548C;User-Based&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;&#x7C7B;&#x4F3C;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x8BA1;&#x7B97;Item&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x8BA1;&#x7B97;&#x76F8;&#x4F3C;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x76AE;&#x5C14;&#x900A;&#x5173;&#x7CFB;&#x7CFB;&#x6570;&#x6216;&#x8005;&#x4F59;&#x5F26;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x8FD9;&#x91CC;&#x7ED9;&#x51FA;&#x4E00;&#x79CD;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7CFB;&#x7EDF;&#x5E38;&#x7528;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#xFF0C;&#x5373;&#x57FA;&#x4E8E;&#x6761;&#x4EF6;&#x6982;&#x7387;&#x8BA1;&#x7B97;Item&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x8BA1;&#x7B97;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;<br><img src="/2016/07/21/Correlation/itemsimailar.png" alt=""><br>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x7B14;&#x8005;&#x4E0D;&#x662F;&#x5F88;&#x4E86;&#x89E3;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5F88;&#x8BA4;&#x53EF;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4ED6;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;&#x5426;&#x5728;0&#x5230;1&#x4E4B;&#x95F4;&#xFF0C;&#x5404;&#x4F4D;&#x770B;&#x5B98;&#xFF0C;&#x4F60;&#x4EEC;&#x662F;&#x5426;&#x540C;&#x611F;&#x5462;&#xFF1F;<br>&#x5176;&#x4E2D;&#xFF0C;s(i, j)&#x8868;&#x793A;&#x9879;i&#x548C;j&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#xFF1B;freq(ij)&#x8868;&#x793A;i&#x548C;j&#x5171;&#x540C;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#xFF1B;freq(i)&#x8868;&#x793A;i&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#xFF1B;freq(j)&#x8868;&#x793A;j&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#xFF1B;&#x8868;&#x793A;&#x963B;&#x529B;&#x56E0;&#x5B50;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5E73;&#x8861;&#x63A7;&#x5236;&#x6D41;&#x884C;&#x548C;&#x70ED;&#x95E8;&#x7684;Item&#xFF0C;&#x8B6C;&#x5982;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x4E2D;&#x7684;&#x70ED;&#x9500;&#x5546;&#x54C1;&#x7B49;&#x3002;<br>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6839;&#x636E;&#x4E0A;&#x8FF0;&#x8BA1;&#x7B97;&#x7684;Item&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x77E9;&#x9635;&#xFF0C;&#x7ED3;&#x5408;&#x7528;&#x6237;&#x7684;&#x8BC4;&#x5206;&#xFF0C;&#x9884;&#x6D4B;&#x672A;&#x77E5;&#x8BC4;&#x5206;&#x3002;&#x9884;&#x6D4B;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;<br><img src="/2016/07/21/Correlation/restrateion.png" alt=""><h3 id="&#x5B9E;&#x9645;&#x5E94;&#x7528;"><a href="#&#x5B9E;&#x9645;&#x5E94;&#x7528;" class="headerlink" title="&#x5B9E;&#x9645;&#x5E94;&#x7528;"></a>&#x5B9E;&#x9645;&#x5E94;&#x7528;</h3>&#x8FD9;&#x91CC;&#x4EC5;&#x5217;&#x51FA;Item-Based&#xFF0C;User-Based&#x5728;&#x90A3;&#x7BC7;&#x535A;&#x6587;&#x91CC;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x7684;&#x975E;&#x5E38;&#x8BE6;&#x7EC6;&#x4E86;&#x3002;<br>&#x5728;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5546;&#x54C1;&#x76F8;&#x4F3C;&#x5EA6;&#x8BA1;&#x7B97;&#x6709;&#x7740;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5B83;&#x65E2;&#x53EF;&#x7528;&#x4E8E;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x63A8;&#x8350;&#x573A;&#x666F;&#xFF0C;&#x8B6C;&#x5982;&#x76F4;&#x63A5;&#x6839;&#x636E;&#x5F53;&#x524D;&#x7684;&#x5546;&#x54C1;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x63A8;&#x8350;&#x76F8;&#x4F3C;&#x5EA6;&#x6700;&#x9AD8;&#x7684;Top N&#x5546;&#x54C1;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x4E2A;&#x6027;&#x5316;&#x63A8;&#x8350;&#xFF0C;&#x4ECE;&#x800C;&#x4E3A;&#x7528;&#x6237;&#x63A8;&#x8350;&#x5546;&#x54C1;&#x3002;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7F51;&#x7AD9;&#x6536;&#x96C6;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x7528;&#x6237;&#x65E5;&#x5FD7;&#xFF0C;&#x8B6C;&#x5982;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x65E5;&#x5FD7;&#x7B49;&#x3002;<br>&#x57FA;&#x4E8E;Item-Based&#x534F;&#x540C;&#x8FC7;&#x6EE4;&#x7B97;&#x6CD5;&#xFF0C;&#x7B14;&#x8005;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x589E;&#x91CF;&#x5F0F;&#x5546;&#x54C1;&#x76F8;&#x4F3C;&#x5EA6;&#x7684;&#x8BA1;&#x7B97;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;<br>&#x5177;&#x4F53;&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#x3002;<ol>
<li>&#x83B7;&#x53D6;&#x5F53;&#x5929;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x884C;&#x4E3A;&#x6570;&#x636E;&#xFF0C;&#x8FC7;&#x6EE4;&#x6389;&#x4E00;&#x4E9B;&#x566A;&#x58F0;&#x6570;&#x636E;&#xFF0C;&#x8B6C;&#x5982;&#x5546;&#x54C1;&#x4FE1;&#x606F;&#x7F3A;&#x5931;&#x7B49;&#x3002;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x7528;&#x6237;&#x4F1A;&#x8BDD;sessionID&#x3001;&#x5546;&#x54C1;ID&#xFF08;&#x5546;&#x54C1;&#x6807;&#x8BC6;&#xFF09;&#x3001;&#x6D4F;&#x89C8;&#x65F6;&#x95F4;&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x8868;5-1&#x6240;&#x793A;&#x3002;&#x7531;&#x4E8E;A4&#x7684;&#x6D4F;&#x89C8;&#x65F6;&#x95F4;&#x548C;A1&#x3001;A2&#x3001;A3&#x76F8;&#x5DEE;&#x8F83;&#x5927;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;&#x5176;&#x8FC7;&#x6EE4;&#x6389;&#xFF0C;&#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x4E3A;1800&#x79D2;&#xFF0C;&#x5982;&#x8868;5-2&#x6240;&#x793A;&#x3002;<br>&#x8868;5-1 &#x7528;&#x6237;&#x70B9;&#x51FB;&#x884C;&#x4E3A;&#x65E5;&#x5FD7;&#x8868;</li>
</ol>
</li>
</ul>
<table>
<thead>
<tr>
<th style="text-align:left">&#x7528;&#x6237;&#x4F1A;&#x8BDD;ID</th>
<th style="text-align:left">&#x6D4F;&#x89C8;&#x5546;&#x54C1;&#x7684;&#x65F6;&#x95F4;</th>
<th style="text-align:left">Item Pairs</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">A1,</td>
<td style="text-align:left">20:12</td>
<td style="text-align:left">A1, A2   A1, A3</td>
</tr>
<tr>
<td style="text-align:left">A2,</td>
<td style="text-align:left">20:13</td>
<td style="text-align:left">A2,A1   A2, A3</td>
</tr>
<tr>
<td style="text-align:left">A3,</td>
<td style="text-align:left">20:15</td>
<td style="text-align:left">A3,A1   A3, A2</td>
</tr>
<tr>
<td style="text-align:left">A4,</td>
<td style="text-align:left">23:30</td>
</tr>
</tbody>
</table>
<p>&#x8868;5-2 &#x8FC7;&#x6EE4;&#x540E;&#x7684;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x884C;&#x4E3A;&#x65E5;&#x5FD7;&#x8868;</p>
<table>
<thead>
<tr>
<th style="text-align:left"></th>
<th style="text-align:left">&#x6D4F;&#x89C8;&#x5546;&#x54C1;&#x7684;&#x65F6;&#x95F4;</th>
<th style="text-align:left">Item Pairs</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">A1,</td>
<td style="text-align:left">20:12</td>
<td style="text-align:left">A1, A2</td>
<td style="text-align:left">A1, A3</td>
</tr>
<tr>
<td style="text-align:left">A2,</td>
<td style="text-align:left">20:13</td>
<td style="text-align:left">A2,A1</td>
<td style="text-align:left">A2, A3</td>
</tr>
<tr>
<td style="text-align:left">A3,</td>
<td style="text-align:left">20:15</td>
<td style="text-align:left">A3,A1</td>
<td style="text-align:left">A3, A2</td>
</tr>
</tbody>
</table>
<ol>
<li>&#x9996;&#x5148;&#xFF0C;&#x8BA1;&#x7B97;&#x4EFB;&#x610F;&#x4E24;&#x79CD;&#x5546;&#x54C1;&#x4E4B;&#x95F4;&#x7684;&#x5171;&#x540C;&#x70B9;&#x51FB;&#x6B21;&#x6570;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6839;&#x636E;&#x57FA;&#x4E8E;&#x6761;&#x4EF6;&#x6982;&#x7387;&#x7684;&#x5546;&#x54C1;&#x76F8;&#x4F3C;&#x5EA6;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x6765;&#x8BA1;&#x7B97;&#x5546;&#x54C1;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x3002;&#x5546;&#x54C1;&#x76F8;&#x4F3C;&#x5EA6;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#x3002;<br><img src="/2016/07/21/Correlation/itemsimailar.png" alt=""><br>&#x5176;&#x4E2D;&#xFF0C;s(i, j)&#x8868;&#x793A;&#x9879;i&#x548C;j&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#xFF1B;freq(ij)&#x8868;&#x793A;i&#x548C;j&#x5171;&#x540C;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#xFF1B;freq(i)&#x8868;&#x793A;i&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#xFF1B;freq(j)&#x8868;&#x793A;j&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#x3002;<br>&#x5408;&#x5E76;&#x524D;&#x4E00;&#x5929;&#x8BA1;&#x7B97;&#x7684;&#x5546;&#x54C1;&#x76F8;&#x4F3C;&#x5EA6;&#x6570;&#x636E;&#xFF0C;&#x8FDB;&#x884C;&#x6295;&#x7968;&#x5224;&#x65AD;&#xFF0C;&#x9009;&#x62E9;&#x76F8;&#x4F3C;&#x5EA6;&#x8F83;&#x5927;&#x7684;&#x4F5C;&#x4E3A;&#x65B0;&#x7684;&#x5546;&#x54C1;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x589E;&#x91CF;&#x5F0F;&#x5546;&#x54C1;&#x76F8;&#x4F3C;&#x5EA6;&#x8BA1;&#x7B97;&#x3002;<h3 id="&#x53C2;&#x8003;&#x6587;&#x732E;"><a href="#&#x53C2;&#x8003;&#x6587;&#x732E;" class="headerlink" title="&#x53C2;&#x8003;&#x6587;&#x732E;"></a>&#x53C2;&#x8003;&#x6587;&#x732E;</h3><ol>
<li>&#x77E5;&#x4E4E;&#x793E;&#x533A;</li>
<li>&#x6570;&#x636E;&#x6316;&#x6398;&#x4E0E;&#x6570;&#x636E;&#x5316;&#x8FD0;&#x8425;&#x5B9E;&#x6218;&#xFF1A;&#x601D;&#x8DEF;&#x3001;&#x65B9;&#x6CD5;&#x3001;&#x6280;&#x5DE7;&#x4E0E;&#x5E94;&#x7528;</li>
<li>&#x767E;&#x5EA6;</li>
<li>&#x7EA2;&#x9ED1;&#x8054;&#x76DF;</li>
</ol>
</li>
</ol>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/搜索推荐/">搜索推荐</a>
</div>


</div>



	<div class="article-share" id="share">
	
	  <div data-url="http://yoursite.com/2016/07/21/Correlation/" data-title="推荐引擎之协同过滤算法小综述 | Timmy live" data-tsina="null" class="share clearfix">
	  </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 

<div class="next">
<a href="/2016/07/21/PearsonCorrelation/"  title="皮尔森系数综述">
 <strong>下一篇：</strong><br/> 
 <span>皮尔森系数综述
</span>
</a>
</div>

</nav>

	
<section id="comments" class="comment">
	<div class="ds-thread" data-thread-key="2016/07/21/Correlation/" data-title="推荐引擎之协同过滤算法小综述" data-url="http://yoursite.com/2016/07/21/Correlation/"></div>
</section>


</div>  
      <div class="openaside"><a class="navbutton" href="#" title="Show Sidebar"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">Contents</strong>
 
 <ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#转自-DM张朋飞-CNBlogs"><span class="toc-number">1.</span> <span class="toc-text">转自 DM张朋飞 CNBlogs</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#数学期望的理解"><span class="toc-number">1.1.</span> <span class="toc-text">数学期望的理解</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#皮尔逊相关系数的理解"><span class="toc-number">1.2.</span> <span class="toc-text">皮尔逊相关系数的理解</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#基于用户的协同过滤算法"><span class="toc-number">1.3.</span> <span class="toc-text">基于用户的协同过滤算法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#基于物品的协同过滤算法"><span class="toc-number">1.4.</span> <span class="toc-text">基于物品的协同过滤算法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#实际应用"><span class="toc-number">1.5.</span> <span class="toc-text">实际应用</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#参考文献"><span class="toc-number">1.6.</span> <span class="toc-text">参考文献</span></a></li></ol></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="Hide Sidebar"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">Categories</p>
		<ul>
		
		  
			<li><a href="/categories/工程手册/" title="工程手册">工程手册<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/搜索推荐/" title="搜索推荐">搜索推荐<sup>3</sup></a></li>
		  
		
		  
			<li><a href="/categories/环境部署/" title="环境部署">环境部署<sup>2</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">Tags</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/centos/" title="centos">centos<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/hadoop/" title="hadoop">hadoop<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/代码约定/" title="代码约定">代码约定<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/spring/" title="spring">spring<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/dubbo/" title="dubbo">dubbo<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/eclipse/" title="eclipse">eclipse<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/zookeeper/" title="zookeeper">zookeeper<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">Links</p>
    <ul>
        
          <li>
            
            	<a href="http://www.hoterran.info" target="_blank" title="一个面向程序员交流分享的新一代社区">运维与开发</a>
            
          </li>
        
          <li>
            
            	<a href="http://club.alibabatech.org/" target="_blank" title="ali Blog">ali Blog</a>
            
          </li>
        
    </ul>
</div>

  <div class="weiboshow">
  <p class="asidetitle">Weibo</p>
    <iframe width="100%" height="119" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=119&fansRow=2&ptype=1&speed=0&skin=9&isTitle=1&noborder=1&isWeibo=0&isFans=0&uid=null&verifier=b3593ceb&dpc=1"></iframe>
</div>


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Christiansted, United States Virgin Islands <br/>
			believer it or not</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/3665494445" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="Lee">Lee</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina'),
      description = $this.attr('description');
  var html = [
  '<div class="hoverqrcode clearfix"></div>',
  '<a class="overlay" id="qrcode"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="微信"></a>',
  '<a href="http://widget.renren.com/dialog/share?resourceUrl=' + encodedUrl + '&srcUrl=' + encodedUrl + '&title=' + title +'" class="article-share-renren" target="_blank" title="人人"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="微博"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);

  $('.hoverqrcode').hide();

  var myWidth = 0;
  function updatehoverqrcode(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
    var qrsize = myWidth > 1024 ? 200:100;
    var options = {render: 'image', size: qrsize, fill: '#2ca6cb', text: url, radius: 0.5, quiet: 1};
    var p = $('.article-share-qrcode').position();
    $('.hoverqrcode').empty().css('width', qrsize).css('height', qrsize)
                          .css('left', p.left-qrsize/2+20).css('top', p.top-qrsize-10)
                          .qrcode(options);
  };
  $(window).resize(function(){
    $('.hoverqrcode').hide();
  });
  $('.article-share-qrcode').click(function(){
    updatehoverqrcode();
    $('.hoverqrcode').toggle();
  });
  $('.article-share-qrcode').hover(function(){}, function(){
      $('.hoverqrcode').hide();
  });
});   
</script>



<script type="text/javascript">
  var duoshuoQuery = {short_name:"witerlee"};
  (function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0] 
    || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
</script> 







<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->



<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?e6d1f421bbc9962127a50488f9ed37d1";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>



<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="Back to Top"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
